---
kind: type
id: T:Autodesk.Revit.DB.PrintSetting
source: html/4d303fcb-ff74-de75-933a-3e8d47d11716.htm
---
# Autodesk.Revit.DB.PrintSetting

Represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.

## Syntax (C#)
```csharp
public class PrintSetting : Element,
	IPrintSetting
```